import MainTitle from "./Title";
import "../Components_Style/AboutUs.css";
function AboutUs() {
  return (
    <section className="about-us">
      <MainTitle text="من نحن" />
      <div className="container">
        <div className="text">
          نحن شركة زكي سليوشن الالكتروني، شركة تقنية رائدة في مجال تطوير
          البرمجيات والتقنيات الحديثة. تأسست الشركة عام 2022 ومقرها الرئيسي في
          مدينة القاهرة بجمهورية مصر العربية، وتعمل على توفير حلول تقنية مبتكرة
          ومتطورة لعملائها في مختلف المجالات الصناعية.
          <br />
          <br />
          نحن نتميز بفريق عمل مؤهل ومتخصص في مجالات تطوير البرمجيات وتقنيات
          المعلومات، ونحن نعمل بشكل مستمر على تطوير وتحسين خدماتنا ومنتجاتنا
          لتلبية احتياجات عملائنا بشكل أفضل. ونحن نولي اهتمامًا كبيرًا بالجودة
          والابتكار والاستجابة السريعة لمتطلبات السوق، مما يجعلنا شريكًا موثوقًا
          به لعملائنا.
          <br />
          <br />
          توفر شركتنا حلول تقنية متنوعة، بما في ذلك تطوير التطبيقات الخاصة
          بالهواتف المحمولة والويب، وتصميم وتطوير مواقع الإنترنت، والبرمجيات
          المخصصة لإدارة الشركات، وحلول الذكاء الاصطناعي والتعلم الآلي والأتمتة،
          والحلول السحابية والتخزين السحابي والأمن السيبراني.
          <br />
          <br />
          نحن نسعى دائمًا لتحقيق رؤيتنا في أن نكون الشركة الأولى في مجال تقنية
          المعلومات والحلول الرقمية في المنطقة، ونحن نعمل بجد لتحقيق هذه الرؤية
          من خلال توفير أفضل الخدمات والمنتجات لعملائنا والمساهمة في تطوير
          المجتمع والاقتصاد المحلي
        </div>
      </div>
    </section>
  );
}

export default AboutUs;
