import MainTitle from "./Title";
import "../Components_Style/Rules.css";

function Rules() {
  return (
    <>
      <section className="rules">
        <MainTitle text="شروط الاستخدام" />
        <div className="container">
          <h3>شروط الاستخدام : </h3>
          <p>
            يجب على كل مستخدم لموقع شركة زكي سليوشن الالكتروني الالتزام بالشروط
            التالية :
          </p>
          <ul>
            <li>
              <h4>1- الالتزام بالقوانين</h4>
              <h5>
                يجب على المستخدم الالتزام بجميع القوانين واللوائح المعمول بها في
                البلد الذي يقيم فيه، بالإضافة إلى الالتزام بشروط الاستخدام
                الخاصة بموقع شركة زكي سليوشن الالكتروني.
              </h5>
            </li>
            <li>
              <h4>2- استخدام الموقع بشكل مشروع</h4>
              <h5>
                يجب على المستخدم استخدام الموقع بشكل مشروع، وعدم استخدامه لأي
                غرض غير قانوني أو يتعارض بالإساءة إلى الشركة أو إلى المستخدمين
                الآخرين.
              </h5>
            </li>
            <li>
              <h4>3- حقوق الملكية الفكرية</h4>
              <h5>
                يجب على المستخدم احترام حقوق الملكية الفكرية المتعلقة بالمحتوى
                الموجود على الموقع، وعدم نسخ أو توزيع أي جزء منه دون إذن كتابي
                من الشركة.
              </h5>
            </li>
            <li>
              <h4>4- تحديث شروط الاستخدام</h4>
              <h5>
                قد تتغير شروط الاستخدام لدى شركة زكي سليوشن الالكتروني في أي
                وقت، ويجب على المستخدمين الالتزام بأي تغييرات جديدة في الشروط.{" "}
              </h5>
            </li>
            <li>
              <h4>5- تحمل المسؤولية</h4>
              <h5>
                يتحمل المستخدمون المسؤولية الكاملة عن استخدامهم للموقع، ويقع
                عليهم مسؤولية التعويض عن أي خسائر تنتج عن استخدامهم للموقع
                بطريقة غير مشروعة أو غير مسموح بها.
              </h5>
            </li>
            <li>
              <h4>6- الإنهاء والإيقاف</h4>
              <h5>
                تحتفظ شركة زكي سليوشن الالكتروني بحق إنهاء أو إيقاف حساب أي
                مستخدم يخالف شروط الاستخدام دون إشعار مسبق، وكذلك بحق تعليق أو
                إيقاف خدمات الموقع في أي وقت دون إشعار مسبق.
              </h5>
            </li>
            <li>
              <h4>7- التعويض</h4>
              <h5>
                يوافق المستخدمون على تعويض شركة زكي سليوشن الالكتروني عن أي
                خسائر أو أضرار تنتج من استخدامهم للموقع بطريقة غير مشروعة أو غير
                مسموح بها.
              </h5>
            </li>
          </ul>
        </div>
      </section>
      <section className="rules">
        <MainTitle text="سياسة الخصوصية " />
        <div className="container">
          <h3>شروط الاستخدام : </h3>
          <p>
            يجب على كل مستخدم لموقع شركة زكي سليوشن الالكتروني الالتزام بالشروط
            التالية :
          </p>
          <ul>
            <li>
              <h4>1- الالتزام بالقوانين</h4>
              <h5>
                يجب على المستخدم الالتزام بجميع القوانين واللوائح المعمول بها في
                البلد الذي يقيم فيه، بالإضافة إلى الالتزام بشروط الاستخدام
                الخاصة بموقع شركة زكي سليوشن الالكتروني.
              </h5>
            </li>
            <li>
              <h4>2- استخدام الموقع بشكل مشروع</h4>
              <h5>
                يجب على المستخدم استخدام الموقع بشكل مشروع، وعدم استخدامه لأي
                غرض غير قانوني أو يتعارض بالإساءة إلى الشركة أو إلى المستخدمين
                الآخرين.
              </h5>
            </li>
            <li>
              <h4>3- حقوق الملكية الفكرية</h4>
              <h5>
                يجب على المستخدم احترام حقوق الملكية الفكرية المتعلقة بالمحتوى
                الموجود على الموقع، وعدم نسخ أو توزيع أي جزء منه دون إذن كتابي
                من الشركة.
              </h5>
            </li>
            <li>
              <h4>4- تحديث شروط الاستخدام</h4>
              <h5>
                قد تتغير شروط الاستخدام لدى شركة زكي سليوشن الالكتروني في أي
                وقت، ويجب على المستخدمين الالتزام بأي تغييرات جديدة في الشروط.{" "}
              </h5>
            </li>
            <li>
              <h4>5- تحمل المسؤولية</h4>
              <h5>
                يتحمل المستخدمون المسؤولية الكاملة عن استخدامهم للموقع، ويقع
                عليهم مسؤولية التعويض عن أي خسائر تنتج عن استخدامهم للموقع
                بطريقة غير مشروعة أو غير مسموح بها.
              </h5>
            </li>
            <li>
              <h4>6- الإنهاء والإيقاف</h4>
              <h5>
                تحتفظ شركة زكي سليوشن الالكتروني بحق إنهاء أو إيقاف حساب أي
                مستخدم يخالف شروط الاستخدام دون إشعار مسبق، وكذلك بحق تعليق أو
                إيقاف خدمات الموقع في أي وقت دون إشعار مسبق.
              </h5>
            </li>
            <li>
              <h4>7- التعويض</h4>
              <h5>
                يوافق المستخدمون على تعويض شركة زكي سليوشن الالكتروني عن أي
                خسائر أو أضرار تنتج من استخدامهم للموقع بطريقة غير مشروعة أو غير
                مسموح بها.
              </h5>
            </li>
          </ul>
        </div>
      </section>
    </>
  );
}

export default Rules;
